[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant (Sansevieria trifasciata) is a remarkably hardy and resilient indoor plant, often referred to as the ‘mother-in-law’s tongue’ due to its upright, sword‑like leaves. Its ability to thrive in low light, survive neglected watering, and adapt to a range of indoor conditions makes it a stellar choice for those new to houseplants or with busy schedules. Beyond its aesthetic appeal, the Snake Plant is also a champion of air purification — NASA’s studies and other indoor‑plant research have shown that it helps filter out toxins like formaldehyde, xylene, and toluene, making the air in your home cleaner and healthier. In terms of care, the Snake Plant prefers a well‑draining potting mix and occasional watering, allowing the soil to dry out between sessions. It tolerates low to moderate indirect light, and will even survive in a corner with minimal sunlight — though brighter indirect light will encourage faster growth. One of the major advantages of this plant is its structural architectural look with tall, narrow variegated leaves that can complement modern, minimalist, or tropical décor. Whether placed in a bedroom, office, or living room, it adds both visual and functional value. For those who travel often or forget watering, this plant is forgiving and remains one of the best low‑maintenance choices. With a stock of ten in hand, you'll have the opportunity to place this plant in your home or gift it to someone looking to bring a bit of green ease into their day.",
    "image": "/images/SnackPlant.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 22,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Medium",
    "description": "The Peace Lily (Spathiphyllum spp.) is known for its elegant white spathes, deep green glossy foliage, and calming presence in indoor spaces. It thrives in indirect light, making it suitable for living rooms, offices, and bedrooms where sunlight is filtered rather than direct. Beyond aesthetics, the Peace Lily offers air‑cleaning benefits by reducing volatile organic compounds and improving indoor air quality. When well‑cared for, you’ll be rewarded with its delicate white blooms and a lush green form that remains striking throughout the season. Care level is medium—meaning you’ll need to keep the soil slightly moist, avoid overwatering, and place it in a spot with bright, indirect light. If the leaves begin to droop, it often indicates a need for water; a quick drink and the plant typically perks right up. It also enjoys a humid environment, so occasional misting or placement near a humidifier benefits it. Aesthetically, the Peace Lily blends well in minimalist or tropical interiors, and its tranquil white flowers bring a sense of peace and calm—hence the name. With 15 units in stock, this plant offers both beauty and function, ideal for gift‑givers or anyone looking to elevate their indoor environment with leafy elegance and cleaner air.",
    "image": "/images/PeaceLily.png",
    "providerName": "Leaf & Root"
  },
  {
    "plantId": 3,
    "plantName": "Monstera Deliciosa",
    "category": "Decorative",
    "price": 30,
    "rating": 4.9,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Monstera Deliciosa (often called the Swiss Cheese Plant) is a tropical show‑stopper with its large, glossy green leaves featuring dramatic splits and fenestrations. This bold plant brings the rainforest aesthetic indoors and instantly becomes a focal point in any room. It thrives in bright, indirect light, with moderate humidity and consistent watering—allowing the top of the soil to dry slightly between watering sessions. The Monstera’s impressive size and architectural form make it well‑suited for larger indoor spaces such as living rooms, lofts, or studios with high ceilings. Beyond its visual appeal, this plant adds a sense of vitality and lushness to your interior décor. Care level is medium, so it does require some attention to maintain its health and shape, including occasional pruning to manage its size and promote healthy growth. Its climbing nature allows it to grow upward if provided with a moss pole or stake, further enhancing its tropically dramatic effect. With only seven in stock, it becomes a premium piece for those looking to invest in a standout plant that combines nature’s artistry with indoor style.",
    "image": "/images/MonsteraDeliciosa.png",
    "providerName": "TropicNest"
  },
  {
    "plantId": 4,
    "plantName": "Aloe Vera",
    "category": "Medicinal",
    "price": 12,
    "rating": 4.7,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "The Aloe Vera plant (Aloe barbadensis) has long been cherished not just for its minimal care demands, but also for its healing properties. Each thick, fleshy leaf contains a cooling gel that has been used for centuries for soothing skin irritations, minor burns, and even hair treatments. As an indoor succulent, Aloe Vera thrives in bright, indirect light (and tolerates some full sun), and prefers well‑draining soil with infrequent watering—allowing the soil to dry out completely between waterings helps prevent rot. This makes it an excellent pick for newcomers to plant care or anyone seeking a blend of function and beauty. Its luminous green leaves form a compact rosette, adding a sleek architectural accent to windowsills, countertops, or small indoor gardens. Because the plant naturally stores water in its leaves, it withstands occasional forgetfulness and remains forgiving. In home décor, it fits minimalist, Scandinavian, and modern aesthetics seamlessly. With a healthful green presence and a host of benefits, this plant is both decorative and practical. With 20 units in stock, it’s an accessible option for gift‑giving, wellness‑focused households, or simply adding a bit of evergreen calm to your space.",
    "image": "/images/AloeVera.png",
    "providerName": "Green Essentials"
  },
  {
    "plantId": 5,
    "plantName": "Fiddle Leaf Fig",
    "category": "Decorative",
    "price": 35,
    "rating": 4.5,
    "availableStock": 5,
    "careLevel": "Hard",
    "description": "The Fiddle Leaf Fig (Ficus lyrata) is a design‑forward classic that has gained cult status in interior décor. With its dramatic, broad, violin‑shaped leaves reaching toward the light, it commands attention in any space. Because of its large size and expressive form, it’s ideal for taller ceilings or large open living rooms. Care wise, it’s rated as hard due to its sensitivity: it prefers bright, consistent indirect light, steady humidity, and well‑draining soil. Inconsistent watering, drafts, or sudden changes in environment can cause leaf drop or spotting, so it is best suited for someone who loves the process of plant care and is willing to invest a bit more time and attention. When thriving, the Fiddle Leaf Fig becomes a statement piece and adds height, texture, and a beautiful vertical accent to a room. Its sculptural presence and elegant silhouette pair beautifully with contemporary, mid‑century modern, and minimal luxe aesthetics. With only five available, each unit is a special piece and a premium investment for interior enthusiasts seeking that wow factor in their plant collection.",
    "image": "/images/FiddleLeafFig.png",
    "providerName": "NatureScape"
  },
  {
    "plantId": 6,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 14,
    "rating": 4.8,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "The Spider Plant (Chlorophytum comosum) is a beloved classic among houseplants thanks to its graceful arching leaves, small baby ‘spiderettes,’ and easy care routine. It adapts well to a wide range of indoor environments, tolerating lower light levels and irregular watering, though it thrives best in bright, indirect light with well‑draining soil. Known for its air‑purifying capabilities, it helps reduce airborne toxins like carbon monoxide and formaldehyde, contributing to healthier indoor air. The Spider Plant is also great for propagation-rich households: those little offsets can be nurtured into new plants, making it a fun option for shared gifts or beginner plant projects. It pairs wonderfully with hanging baskets or elevated planters, where its trailing leaves can cascade and soften architectural angles. Whether placed in a living room, home office, or children’s room, its forgiving nature and lush green foliage bring an effortless freshness to your space. With 12 in stock, it’s a friendly, functional, and beautiful plant choice for many homes.",
    "image": "/images/SpiderPlant.png",
    "providerName": "Leaf & Root"
  },
  {
    "plantId": 7,
    "plantName": "Rubber Plant",
    "category": "Decorative",
    "price": 28,
    "rating": 4.6,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "The Rubber Plant (Ficus elastica) is a bold, sculptural indoor tree with glossy, thick leaves that create a strong vertical presence in any room. Its large, waxy leaves come in various shades and often shimmer in indirect light, giving the plant a sophisticated and modern appeal. Care is rated medium: the plant prefers bright, indirect light, moderate watering (allowing the top inch or two of soil to dry out between sessions), and consistent conditions to avoid leaf drop or browning. Because of its upright growth, the Rubber Plant can be trained into a tree form or kept compact, depending on your space. It adds height without a wide footprint, making it perfect for corners, entryways, or beside windows. The dark green foliage contrasts beautifully with lighter décor, and its stately presence elevates a room’s ambiance. With nine units available, this plant offers a refined blend of dramatic style and moderate care requirements—ideal for someone ready to step up their indoor greenery game.",
    "image": "/images/RubberPlant.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 8,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 16,
    "rating": 4.7,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "The Jade Plant (Crassula ovata) is a succulent symbol of prosperity and good fortune, featuring plump, glossy leaves and a tree‑like structure that matures gracefully with time. Often found in homes and offices, it thrives in bright light—ideally southern or western exposure—and prefers well‑draining soil with minimal watering, allowing it to dry almost fully between waterings. Its low-maintenance nature makes it an excellent choice for beginners, busy homes, or compact spaces like desks and windowsills. Over time, with proper care, your Jade Plant can develop a woody trunk and become a charming miniature indoor tree, adding green texture and character to your interior. Its compact footprint and architectural form work well in minimalist, Scandinavian, or modern planter styles. With 14 in stock, it’s a thoughtful gift option and a reliable addition for those seeking both aesthetics and easy care in one plant.",
    "image": "/images/JadePlant.png",
    "providerName": "Succulent Co."
  },
  {
    "plantId": 9,
    "plantName": "Boston Fern",
    "category": "Hanging",
    "price": 20,
    "rating": 4.4,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "The Boston Fern (Nephrolepis exaltata ‘Bostoniensis’) brings lush, feathery fronds that cascade beautifully, making it a classic choice for hanging baskets or elevated planters. Its vibrant green foliage adds softness and fullness to interiors, evoking a cozy, tropical atmosphere. While it thrives in bright, indirect light, it also benefits from high humidity—making bathrooms, covered patios, or locations near humidifiers ideal. Soil should be kept consistently moist but not soggy; occasional misting can help maintain its lushness and prevent drying out. Though moderately easy, it requires a bit more attention in terms of humidity and watering consistency compared to some other houseplants. The Boston Fern’s trailing shape adds dimension and visual movement to rooms, especially when placed on shelves or near windowsills. With eleven units in stock, this plant invites someone to bring softness, greenery and texture into their space through a vibrant hanging display.",
    "image": "/images/BostonFern.png",
    "providerName": "Hanging Hues"
  },
  {
    "plantId": 10,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 24,
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Easy",
    "description": "The ZZ Plant (Zamioculcas zamiifolia) is a near‑indestructible indoor plant famed for its dark glossy leaves and remarkably high tolerance of neglect, low light, and irregular watering. It’s an ideal option for offices, low‑light rooms, or plant‑newbies who want green without fuss. This plant stores water in its thick rhizomes, allowing it to thrive even when watered infrequently. It prefers indirect light and can handle shady corners where many other plants struggle. Its trailing stems and upright growth habit lead to a lush, shiny texture that catches light beautifully, adding a subtle but impactful elegance to any space. Minimal care, maximum style—this is the promise of the ZZ Plant. With only six available, each unit is a strong pick for those seeking an effortlessly stylish plant that won’t demand daily attention yet delivers lush green presence.",
    "image": "/images/ZZPlant.png",
    "providerName": "GreenScape"
  },
  {
    "plantId": 11,
    "plantName": "Lavender",
    "category": "Herbal",
    "price": 15,
    "rating": 4.6,
    "availableStock": 10,
    "careLevel": "Medium",
    "description": "Lavender (Lavandula spp.) is a fragrant herbal plant distinguished by its silvery‑green foliage and delicate purple flower spikes. Beloved for both its visual appeal and calming aroma, it finds a place in indoor gardens, patios, and herb windowsills alike. Beyond its beauty, the scent of lavender is linked to relaxation, stress relief, and better sleep, making it a welcome addition to bedrooms, relaxation spaces, or even as a DIY aromatherapy companion. It thrives in full to bright light, requires well‑draining soil, and prefers slightly dry conditions between waterings—making it moderately easy to care for with the right environment. While typically grown outdoors, certain lavender varieties can adapt well indoors when given ample light and airflow. Aesthetically, its soft green foliage and violet blooms blend beautifully with rustic, Mediterranean, or cottage‑style décor. With ten available units, it’s a fragrant, functional, and beautiful choice for anyone looking to bring a calm, herbal ambiance into their indoor or semi‑outdoor space.",
    "image": "/images/Lavender.png",
    "providerName": "HerbNest"
  },
  {
    "plantId": 12,
    "plantName": "Cactus Mix",
    "category": "Succulent",
    "price": 10,
    "rating": 4.3,
    "availableStock": 25,
    "careLevel": "Easy",
    "description": "The Cactus Mix is a curated collection of small, spiky succulent friends perfect for desks, windowsills, gifts, or beginner indoor gardens. Each mini‑cactus features its own texture and form—some tall and tapered, others globular and ribbed—bringing variety and playful personality to your space. These plants are drought‑tolerant and prefer bright light, making them resilient even when you’re away often or just forget a watering now and then. Their low‑maintenance nature makes them ideal for modern apartments, offices, or compact corners that receive sunlight. They thrive in gritty, well‑draining soil and appreciate occasional watering followed by longer dry periods. The combination of shapes and sizes in the mix allows you to create interesting visual groupings, perhaps in terrariums or alongside other succulents. With twenty‑five units in stock, this mix is affordable, fun, and accessible for anyone looking to add a playful green touch to a space with minimal fuss.",
    "image": "/images/CactusMix.png",
    "providerName": "Succulent Co."
  },
  {
    "plantId": 13,
    "plantName": "Areca Palm",
    "category": "Indoor Tree",
    "price": 32,
    "rating": 4.5,
    "availableStock": 4,
    "careLevel": "Medium",
    "description": "The Areca Palm (Dypsis lutescens), sometimes called the butterfly palm, brings a lush, tropical feel to indoor spaces with its feathery fronds and soft arching stems. Its relatively slender profile makes it suitable for taller indoor corners or beside windows where it can climb upward without taking up too much floor space. It thrives in bright, filtered light and appreciates regular misting or placement in higher humidity zones, such as near baths or humidifiers. Consistent watering—keeping soil moist but not waterlogged—is key to its health; overwatering or neglect may cause yellowing of fronds. Indoors, the Areca Palm helps soften architectural lines, filter light, and create a relaxing, resort‑style atmosphere. Ideal for living rooms or sunrooms, it pairs beautifully with rattan furniture, natural fiber décor, and neutral palettes. With only four available units, each plant is something of a statement item—perfect for someone looking to invest in an indoor tree that adds height, movement, and a true tropical ambiance to their home.",
    "image": "/images/ArecaPalm.png",
    "providerName": "TropicNest"
  },
  {
    "plantId": 14,
    "plantName": "Pothos",
    "category": "Trailing",
    "price": 13,
    "rating": 4.9,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "The Pothos (Epipremnum aureum), also known as devil’s ivy, is an extremely popular trailing houseplant thanks to its resilience, fast‑growing vines, and heart‑shaped leaves. It thrives in a wide range of indoor lighting conditions—from low to bright indirect—making it one of the most beginner‑friendly plants around. With its trailing habit, it works beautifully in hanging baskets, on bookshelves, or atop cabinets where its vines can cascade gracefully. The Pothos is easy to propagate—just water a cutting and watch roots form—making it ideal for sharing or creating plant collections. It also helps purify indoor air by reducing toxins. Care requires basic attention to allow the top layer of soil to dry between waterings and avoid overwatering. Its generous stock of twenty units means you can easily add trailing greenery to multiple rooms, create visual continuity between spaces, or even gift to friends and family. With a near‑perfect rating of 4.9, this plant is a high‑value pick for anyone looking to green their space with confidence and ease.",
    "image": "/images/Pothosplant.png",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 15,
    "plantName": "Calathea Orbifolia",
    "category": "Decorative",
    "price": 27,
    "rating": 4.4,
    "availableStock": 8,
    "careLevel": "Hard",
    "description": "Calathea Orbifolia is a dramatic and elegant houseplant celebrated for its large, round leaves featuring silver‑green stripes and soft underside tones. Its decorative appeal is strong, making it a favorite for plant enthusiasts who enjoy statement foliage. However, this beauty comes with a higher level of care: it thrives in bright, indirect light but must be shielded from direct sun to avoid leaf burn. It also prefers high humidity—so placement in a bathroom, kitchen, or near a humidifier is ideal—and consistently moist (but not soggy) soil. Hard water, inconsistent watering or dry air may result in brown leaf edges or curling, so attention to details like water quality and humidity is beneficial. When cared for properly, the Calathea Orbifolia becomes a lush, leafy showpiece that elevates interior décor with an exotic, gallery‑worthy vibe. With eight units available, this plant is ideal for a dedicated indoor gardener or someone looking to elevate their plant collection with something visually rich and distinctive.",
    "image": "/images/CalatheaOrbifolia.png",
    "providerName": "Leaf & Root"
  },
  {
    "plantId": 16,
    "plantName": "Chinese Money Plant",
    "category": "Decorative",
    "price": 19,
    "rating": 4.7,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The Chinese Money Plant (Pilea peperomioides) is a charming indoor plant recognized for its round, coin‑like leaves perched atop long, slender stems. Considered lucky and symbolizing wealth in some cultures, it makes a delightful addition to desktops, shelves, or bright windowsills. It prefers bright, indirect light and a well‑draining potting mix, with watering allowed to dry slightly between sessions to avoid root issues. Over time, this plant may produce small plantlets around its base—which can easily be propagated—so it is fun to share and multiply. Its compact size and distinctive leaf shape make it suited for smaller homes or lively arrangements in plant shelves. Whether styling a minimalist modern space or adding a touch of whimsy to a home office, the Chinese Money Plant offers visual interest and low‑maintenance charm. With nine units in stock, this plant is an accessible but slightly rare gem for those looking to cultivate a unique indoor green friend.",
    "image": "/images/ChineseMoney.jpg",
    "providerName": "NatureScape"
  },
  {
    "plantId": 17,
    "plantName": "Mint",
    "category": "Herbal",
    "price": 11,
    "rating": 4.5,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "Mint (Mentha spp.) is a fragrant, fast‑growing herb that brings vitality, scent, and culinary versatility to your home or garden. Its aromatic leaves are ideal for fresh teas, cocktails, salads, and even homemade skincare infusions. Indoors, it prefers bright light or a sunny windowsill, regular watering, and a well‑draining yet moisture‑retentive soil. Because mint can be aggressive in garden beds, growing it in pots or containers is recommended to contain its spread. The visual appeal of mint includes lush green foliage and a fresh scent that fills a room when gently touched or brushed. From a care perspective, it is easy and forgiving, making it a good choice for beginners interested in herbs and edible indoor plants. Whether in a minimalist kitchen, balcony garden, or herb shelf, mint adds both fragrance and functionality. With eighteen in stock, it’s an excellent value pick for those looking to add living herbs to their home and tap into fresh flavors, scents, and wellness benefits.",
    "image": "/images/Mint.png",
    "providerName": "HerbNest"
  },
  {
    "plantId": 18,
    "plantName": "Lucky Bamboo",
    "category": "Indoor Plant",
    "price": 17,
    "rating": 4.6,
    "availableStock": 16,
    "careLevel": "Easy",
    "description": "Lucky Bamboo (Dracaena sanderiana) is a popular indoor plant often associated with prosperity and positive energy—especially in Feng Shui traditions. Its slender green stalks can be trained into twisted spirals or braided forms, making it visually engaging and suitable for modern décor. It grows well in either water-filled containers with pebbles or in well‑draining soil, and prefers bright, indirect light; too much direct sun can cause leaf yellowing. Part of what makes it easy to care for is its adaptable nature: you can change the water every couple of weeks (if grown hydroponically) or use moderate watering in soil setups. While minimal in attention, it brings aesthetic delight, indoor greenery, and a symbolic meaning of luck into homes and offices. With sixteen available units, it’s both an affordable and meaningful plant choice for gifting, décor styling, or adding an easy green accent to personal spaces.",
    "image": "/images/LuckyBamboo.png",
    "providerName": "Green Essentials"
  },
  {
    "plantId": 19,
    "plantName": "Croton",
    "category": "Colorful Foliage",
    "price": 23,
    "rating": 4.2,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Croton (Codiaeum variegatum) is a foliage powerhouse boasting brightly colored leaves in shades of red, orange, yellow, green and purple — making it a vivid visual centerpiece in home interior settings. Its striking appearance demands bright, indirect light (or even some morning sun) to maintain its color vibrancy, and it prefers moderate humidity and consistently moist (but not water‑logged) soil. Because of its desire for certain conditions, it’s rated as medium difficulty — a care enthusiast will relish the challenge of maintaining its blazing hues. Its upright growth and multi‑coloured leaves make it a great fit for statement containers, accent corners, or paired with neutral décor to create a splash of color. With seven units available, it offers a splash of high‑impact foliage for those looking to inject dramatic visual interest into their space while embracing slightly elevated plant care routines.",
    "image": "/images/Croton.png",
    "providerName": "NatureScape"
  },
  {
    "plantId": 20,
    "plantName": "Chamomile",
    "category": "Herbal",
    "price": 14,
    "rating": 4.6,
    "availableStock": 12,
    "careLevel": "Medium",
    "description": "Chamomile (Matricaria chamomilla or Chamaemelum nobile) is a gentle, fragrant herb celebrated for its daisy‑like flowers and calming properties, often used in teas and natural skincare. Indoors or in a well‑lit balcony pot, chamomile enjoys full to bright sun, well‑draining soil, and regular watering with moderate dryness between waterings. Its delicate, feathery foliage and white blooms bring a soft aesthetic that complements rustic, cottage‑garden, or herbal‑apothecary themed interiors. Beyond the visual, its calming scent and traditional uses in relaxation rituals bring an added layer of value—perfect for those interested in wellness, herbal living or a small indoor tea garden. Care is medium since it appreciates sufficient light and consistent watering. With twelve in stock, it’s a soothing and versatile addition to any home—ideal for tea lovers, herb lovers or someone looking to add fragrant green life to their space.",
    "image": "/images/Chamomile.png",
    "providerName": "HerbNest"
  }
]
